###############################################################################
# Created by write_sdc
# Mon Oct 30 15:16:56 2023
###############################################################################
current_design riscv
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {clk}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aluout[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memread}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memwrite}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {suspend}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writedata[9]}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
