###############################################################################
# Created by write_sdc
###############################################################################
current_design chip_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 20.0000 [get_ports {clk_pad}]
set_clock_transition 0.3000 [get_clocks {clk}]
set_clock_uncertainty 0.2000 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aux_enable_pad}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in_pad[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in_pad[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in_pad[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in_pad[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in_pad[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in_pad[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in_pad[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in_pad[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_pad[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_pad[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_pad[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_pad[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_pad[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_pad[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_pad[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_pad[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lfsr_out_pad}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_select_pad[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_select_pad[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_addr_pad[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_addr_pad[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_addr_pad[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_pad}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {shreg_in_pad}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {shreg_out_pad}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_enable_pad}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {aux_enable_pad}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in_pad[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in_pad[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in_pad[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in_pad[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in_pad[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in_pad[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in_pad[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in_pad[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_pad[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_pad[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_pad[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_pad[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_pad[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_pad[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_pad[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_pad[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lfsr_out_pad}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_select_pad[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_select_pad[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_addr_pad[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_addr_pad[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_addr_pad[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_pad}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {shreg_in_pad}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {shreg_out_pad}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_enable_pad}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 5.0000 [get_ports {aux_enable_pad}]
set_load -pin_load 5.0000 [get_ports {clk_pad}]
set_load -pin_load 5.0000 [get_ports {lfsr_out_pad}]
set_load -pin_load 5.0000 [get_ports {rst_pad}]
set_load -pin_load 5.0000 [get_ports {shreg_in_pad}]
set_load -pin_load 5.0000 [get_ports {shreg_out_pad}]
set_load -pin_load 5.0000 [get_ports {wr_enable_pad}]
set_load -pin_load 5.0000 [get_ports {data_in_pad[7]}]
set_load -pin_load 5.0000 [get_ports {data_in_pad[6]}]
set_load -pin_load 5.0000 [get_ports {data_in_pad[5]}]
set_load -pin_load 5.0000 [get_ports {data_in_pad[4]}]
set_load -pin_load 5.0000 [get_ports {data_in_pad[3]}]
set_load -pin_load 5.0000 [get_ports {data_in_pad[2]}]
set_load -pin_load 5.0000 [get_ports {data_in_pad[1]}]
set_load -pin_load 5.0000 [get_ports {data_in_pad[0]}]
set_load -pin_load 5.0000 [get_ports {data_out_pad[7]}]
set_load -pin_load 5.0000 [get_ports {data_out_pad[6]}]
set_load -pin_load 5.0000 [get_ports {data_out_pad[5]}]
set_load -pin_load 5.0000 [get_ports {data_out_pad[4]}]
set_load -pin_load 5.0000 [get_ports {data_out_pad[3]}]
set_load -pin_load 5.0000 [get_ports {data_out_pad[2]}]
set_load -pin_load 5.0000 [get_ports {data_out_pad[1]}]
set_load -pin_load 5.0000 [get_ports {data_out_pad[0]}]
set_load -pin_load 5.0000 [get_ports {out_select_pad[1]}]
set_load -pin_load 5.0000 [get_ports {out_select_pad[0]}]
set_load -pin_load 5.0000 [get_ports {reg_addr_pad[2]}]
set_load -pin_load 5.0000 [get_ports {reg_addr_pad[1]}]
set_load -pin_load 5.0000 [get_ports {reg_addr_pad[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_capacitance 0.5000 [current_design]
set_max_fanout 8.0000 [current_design]
