###############################################################################
# Created by write_sdc
###############################################################################
current_design ElemRVTop
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_core -period 40.0000 [get_pins {sg13g2_IOPadIn_1/p2c}]
set_clock_transition 0.2500 [get_clocks {clk_core}]
set_clock_uncertainty 0.1500 clk_core
set_propagated_clock [get_clocks {clk_core}]
create_clock -name clk_jtag -period 100.0000 [get_pins {sg13g2_IOPadIn_5/p2c}]
set_clock_transition 0.2500 [get_clocks {clk_jtag}]
set_clock_uncertainty 0.1500 clk_jtag
set_propagated_clock [get_clocks {clk_jtag}]
set_input_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_clock_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_gpioStatus_0_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_dq_0_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_dq_1_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_dq_2_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_dq_3_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_dq_4_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_dq_5_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_dq_6_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_dq_7_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_rwds_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_jtag}] -add_delay [get_ports {io_jtag_tck_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_jtag}] -add_delay [get_ports {io_jtag_tdi_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_jtag}] -add_delay [get_ports {io_jtag_tms_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_reset_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_spi_dq_0_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_spi_dq_1_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_uartStd_cts_PAD}]
set_input_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_uartStd_rxd_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_gpioStatus_0_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_ck_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_cs_0_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_dq_0_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_dq_1_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_dq_2_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_dq_3_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_dq_4_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_dq_5_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_dq_6_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_dq_7_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_reset_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_hyperbus_rwds_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_jtag}] -add_delay [get_ports {io_jtag_tdo_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_spi_cs_0_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_spi_dq_0_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_spi_dq_1_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_spi_sck_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_uartStd_rts_PAD}]
set_output_delay 8.0000 -clock [get_clocks {clk_core}] -add_delay [get_ports {io_uartStd_txd_PAD}]
set_false_path\
    -from [get_clocks {clk_core}]\
    -to [get_clocks {clk_jtag}]
set_false_path\
    -from [get_clocks {clk_jtag}]\
    -to [get_clocks {clk_core}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 5.0000 [get_ports {io_clock_PAD}]
set_load -pin_load 5.0000 [get_ports {io_gpioStatus_0_PAD}]
set_load -pin_load 5.0000 [get_ports {io_gpioStatus_1_PAD}]
set_load -pin_load 5.0000 [get_ports {io_gpioStatus_2_PAD}]
set_load -pin_load 5.0000 [get_ports {io_gpioStatus_3_PAD}]
set_load -pin_load 5.0000 [get_ports {io_hyperbus_ck_PAD}]
set_load -pin_load 5.0000 [get_ports {io_hyperbus_cs_0_PAD}]
set_load -pin_load 5.0000 [get_ports {io_hyperbus_dq_0_PAD}]
set_load -pin_load 5.0000 [get_ports {io_hyperbus_dq_1_PAD}]
set_load -pin_load 5.0000 [get_ports {io_hyperbus_dq_2_PAD}]
set_load -pin_load 5.0000 [get_ports {io_hyperbus_dq_3_PAD}]
set_load -pin_load 5.0000 [get_ports {io_hyperbus_dq_4_PAD}]
set_load -pin_load 5.0000 [get_ports {io_hyperbus_dq_5_PAD}]
set_load -pin_load 5.0000 [get_ports {io_hyperbus_dq_6_PAD}]
set_load -pin_load 5.0000 [get_ports {io_hyperbus_dq_7_PAD}]
set_load -pin_load 5.0000 [get_ports {io_hyperbus_reset_PAD}]
set_load -pin_load 5.0000 [get_ports {io_hyperbus_rwds_PAD}]
set_load -pin_load 5.0000 [get_ports {io_jtag_tck_PAD}]
set_load -pin_load 5.0000 [get_ports {io_jtag_tdi_PAD}]
set_load -pin_load 5.0000 [get_ports {io_jtag_tdo_PAD}]
set_load -pin_load 5.0000 [get_ports {io_jtag_tms_PAD}]
set_load -pin_load 5.0000 [get_ports {io_reset_PAD}]
set_load -pin_load 5.0000 [get_ports {io_spi_cs_0_PAD}]
set_load -pin_load 5.0000 [get_ports {io_spi_dq_0_PAD}]
set_load -pin_load 5.0000 [get_ports {io_spi_dq_1_PAD}]
set_load -pin_load 5.0000 [get_ports {io_spi_sck_PAD}]
set_load -pin_load 5.0000 [get_ports {io_uartStd_cts_PAD}]
set_load -pin_load 5.0000 [get_ports {io_uartStd_rts_PAD}]
set_load -pin_load 5.0000 [get_ports {io_uartStd_rxd_PAD}]
set_load -pin_load 5.0000 [get_ports {io_uartStd_txd_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_clock_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioStatus_0_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut30mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_hyperbus_ck_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_hyperbus_cs_0_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut30mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_hyperbus_dq_0_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut30mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_hyperbus_dq_1_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut30mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_hyperbus_dq_2_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut30mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_hyperbus_dq_3_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut30mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_hyperbus_dq_4_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut30mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_hyperbus_dq_5_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut30mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_hyperbus_dq_6_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut30mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_hyperbus_dq_7_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_hyperbus_reset_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut30mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_hyperbus_rwds_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_jtag_tck_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_jtag_tdi_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_jtag_tdo_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_jtag_tms_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_reset_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_spi_cs_0_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_spi_dq_0_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadInOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_spi_dq_1_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_spi_sck_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_uartStd_cts_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_uartStd_rts_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_uartStd_rxd_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_uartStd_txd_PAD}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_capacitance 0.5000 [current_design]
set_max_fanout 8.0000 [current_design]
